### Case Study – 2

#### Domain –HR

#### focus – Insights from data

#### Business challenge/requirement
SFO Public Department - referred to as SFO has captured all the salary data of its
employees from the year 2011-2014. Now we are in the year 2015 and the
organization is facing a financial crisis. As the first step HR wants to rationalize
employee costs to save the payroll budget. You have to do data manipulation and
analysis on the salary data to answer specific questions for cost savings.

#### Key issues
Cost can be saved by figuring out the key pockets of high salaries

#### Considerations
NONE

#### Data volume
- Approx 150K records across files

#### additional information
- NA

#### Business benefits
Save at least 10% of employee costs by identifying and letting them go

#### Approach to Solve
You have to use the fundamentals of Pandas covered in module 6 and answer the
following 5 Questions

In [1]:
import pandas as pd

In [3]:
df=pd.read_csv("data/salaries.csv")
df.head()

C:\Users\736944\AppData\Local\Temp\ipykernel_13960\1942971679.py:1: DtypeWarning: Columns (12) have mixed types. Specify dtype option on import or set low_memory=False.
  df=pd.read_csv("data/salaries.csv")

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

#### 1. Compute how much total salary cost has increased from the year 2011 to 2014

In [29]:
#TotalPay, Year
groupby_df=df.groupby("Year").sum()[["TotalPay"]] 
groupby_df
totalpay_2011=float(groupby_df.query("Year ==2011")["TotalPay"])
totalpay_2014=float(groupby_df.query("Year==2014")["TotalPay"])

increased_total_pay=(totalpay_2014- totalpay_2011)
print(f"Total increased salary cost from the year 2011 to 2014 : {increased_total_pay}")

Total increased salary cost from the year 2011 to 2014 : 282797920.54000044

C:\Users\736944\AppData\Local\Temp\ipykernel_16960\3987180827.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  groupby_df=df.groupby("Year").sum()[["TotalPay"]]

#### 2. Which Job Title in the Year 2014 has the highest mean salary

In [54]:
groupby_job=df.query("Year==2014").groupby("JobTitle").mean()[["TotalPay"]]
highest_salary=groupby_job["TotalPay"].max()
high_pay_job_title=groupby_job[groupby_job["TotalPay"]==highest_salary]
print(f"Job Title in the Year 2014 has the highest mean salary {str(high_pay_job_title)}")

Job Title in the Year 2014 has the highest mean salary                           TotalPay
JobTitle
Chief Investment Officer  339653.7

C:\Users\736944\AppData\Local\Temp\ipykernel_16960\2761109194.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  groupby_job=df.query("Year==2014").groupby("JobTitle").mean()[["TotalPay"]]

#### 3. How much money could have been saved in the Year 2014 by stopping OverTimePay?

In [60]:
groupby_overtime=df.groupby("Year").sum()[["OvertimePay"]]
total_over_time_pay_savings=float(groupby_overtime.query("Year==2014")["OvertimePay"])
print(f"money could have been saved in the Year 2014 by stopping OverTimePay: {total_over_time_pay_savings}" )

money could have been saved in the Year 2014 by stopping OverTimePay: 205918599.27

C:\Users\736944\AppData\Local\Temp\ipykernel_16960\2899240168.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  groupby_overtime=df.groupby("Year").sum()[["OvertimePay"]]

#### 4. Which are the top 5 common jobs in the Year 2014 and how much do they cost SFO?

In [76]:
groupby_common_job_df=df.groupby(["Year", "JobTitle"]).count().filter(["Year", "JobTitle","TotalPay"])
df_common_job_2014=groupby_common_job_df.query("Year==2014")
df_common_job_2014.sort_values("TotalPay", ascending=False).head()

                                   TotalPay
Year JobTitle
2014 Transit Operator                  2479
     Special Nurse                     1478
     Registered Nurse                  1234
     Public Svc Aide-Public Works       916
     Firefighter                        815

#### 5. Who was the top earning employee across all the years?

In [25]:
df_top_earning_emp=df[df["TotalPay"]==df["TotalPay"].max()]
df_top_earning_emp

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

### Enhancements for code

#### You can try these enhancements in code

#### 1. Which are the last 5 common jobs in the Year 2014 and how much do they cost SFO?

In [46]:
df_coomon_jobs_2014=df.groupby(['Year', 'JobTitle']).count().filter(['JobTitle', "TotalPay"]).query("Year==2014").sort_values("TotalPay", ascending=False)
df_coomon_jobs_2014.tail()

                                     TotalPay
Year JobTitle
2014 Marina Associate Manager               1
     Marina Assistant Manager               1
     Light Rail Vehicle Equip Eng           1
     Lieutenant (Police Department)         1
     Youth Comm Advisor                     1

#### 2. In year 201 OverTimePay was what percentage of TotalPayBenefits

In [63]:
df_2011=df.query("Year==2011")

over_time_pay=float(df_2011["OvertimePay"].sum())
total_benifit_pay=float(df_2011["TotalPayBenefits"].sum())
print(over_time_pay)
print(total_benifit_pay)
per=(over_time_pay/total_benifit_pay)*100
print(f"Percentage: {round(per, 2)} %")

163819110.92000002
2594113030.72
Percentage: 6.32 %

#### 3. Which Job Title in the Year 2014 has the lowest mean salary?